# Pandas
- library for Data Analysis and Manipulation


## Why Pandas?
- provides ability to work with Tabular data.
- **Tabular Data** - data that is organized into tables having rows and cols

In [116]:
### Installing Pandas
! pip install pandas

Requirement already satisfied: pandas in c:\users\administrator\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\administrator\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [117]:
import pandas as pd

## Series
- Series is a one dimensional labelled array that can hold/store data

In [118]:
book_title = ['C++', 'Java', 'Python', 'JavaScript']

In [119]:
book_title = pd.Series(book_title)
book_title

0           C++
1          Java
2        Python
3    JavaScript
dtype: object

In [120]:
type(book_title)

pandas.core.series.Series

In [121]:
book_title[2]

'Python'

In [122]:
book_title.index = ['a', 'b', 'c', 'd']

In [123]:
book_title

a           C++
b          Java
c        Python
d    JavaScript
dtype: object

In [124]:
book_title['c']
book_title[2]

'Python'

## DataFrame - Introduction
- 2D labelled array having index and columns. 
- multiple series combined together to form a Dataframe.
- most widely used data structure in pandas

In [125]:
import numpy as np

In [126]:
arr = np.random.randint(10, 100, size =(6, 4))
arr

array([[93, 54, 70, 51],
       [92, 18, 52, 67],
       [25, 85, 15, 90],
       [99, 56, 83, 40],
       [40, 44, 58, 42],
       [68, 11, 64, 21]])

In [127]:
df = pd.DataFrame(arr)
df

    0   1   2   3
0  93  54  70  51
1  92  18  52  67
2  25  85  15  90
3  99  56  83  40
4  40  44  58  42
5  68  11  64  21

In [128]:
type(df)

pandas.core.frame.DataFrame

In [129]:
df[2]

0    70
1    52
2    15
3    83
4    58
5    64
Name: 2, dtype: int32

In [130]:
type(df[2])

pandas.core.series.Series

In [131]:
type(df[0])

pandas.core.series.Series

In [132]:
df.columns =  ['A', 'B','C','D']
df

    A   B   C   D
0  93  54  70  51
1  92  18  52  67
2  25  85  15  90
3  99  56  83  40
4  40  44  58  42
5  68  11  64  21

In [133]:
df['D']

0    51
1    67
2    90
3    40
4    42
5    21
Name: D, dtype: int32

In [134]:
df.shape

(6, 4)

In [135]:
df.head(n=3)

    A   B   C   D
0  93  54  70  51
1  92  18  52  67
2  25  85  15  90

In [136]:
df.tail(n=2)

    A   B   C   D
4  40  44  58  42
5  68  11  64  21

In [137]:
# Extracting Columns
df['C']

0    70
1    52
2    15
3    83
4    58
5    64
Name: C, dtype: int32

In [138]:
# cols = ['A', 'B']
# df[cols]

df[['A', 'B']]

    A   B
0  93  54
1  92  18
2  25  85
3  99  56
4  40  44
5  68  11

In [139]:
df[['B', 'D', 'A']]

    B   D   A
0  54  51  93
1  18  67  92
2  85  90  25
3  56  40  99
4  44  42  40
5  11  21  68

In [140]:
df

    A   B   C   D
0  93  54  70  51
1  92  18  52  67
2  25  85  15  90
3  99  56  83  40
4  40  44  58  42
5  68  11  64  21

In [141]:
# Add New Columns

In [142]:
df['A+B'] = df['A'] + df['B']

In [143]:
df

    A   B   C   D  A+B
0  93  54  70  51  147
1  92  18  52  67  110
2  25  85  15  90  110
3  99  56  83  40  155
4  40  44  58  42   84
5  68  11  64  21   79

In [144]:
df['A-B'] = df['A'] * df['B']

In [145]:
df

    A   B   C   D  A+B   A-B
0  93  54  70  51  147  5022
1  92  18  52  67  110  1656
2  25  85  15  90  110  2125
3  99  56  83  40  155  5544
4  40  44  58  42   84  1760
5  68  11  64  21   79   748

In [146]:
df.drop(columns=['A-B'], inplace=True)

In [147]:
df

    A   B   C   D  A+B
0  93  54  70  51  147
1  92  18  52  67  110
2  25  85  15  90  110
3  99  56  83  40  155
4  40  44  58  42   84
5  68  11  64  21   79

### Indexing/Extracting Data

In [148]:
df.index = "p q r s t u".split()

In [149]:
df

    A   B   C   D  A+B
p  93  54  70  51  147
q  92  18  52  67  110
r  25  85  15  90  110
s  99  56  83  40  155
t  40  44  58  42   84
u  68  11  64  21   79

In [150]:
# loc - location
df.loc['p']

A       93
B       54
C       70
D       51
A+B    147
Name: p, dtype: int32

In [151]:
df.loc['t']

A      40
B      44
C      58
D      42
A+B    84
Name: t, dtype: int32

In [152]:
# iloc - integer location
df.iloc[4]

A      40
B      44
C      58
D      42
A+B    84
Name: t, dtype: int32

In [153]:
df.iloc[0]

A       93
B       54
C       70
D       51
A+B    147
Name: p, dtype: int32

In [154]:
df.iloc[2: 5]

    A   B   C   D  A+B
r  25  85  15  90  110
s  99  56  83  40  155
t  40  44  58  42   84

In [155]:
df.iloc[2][['A']]

A    25
Name: r, dtype: int32

In [156]:
df.iloc[-2:][['D', 'A+B']]

    D  A+B
t  42   84
u  21   79

In [157]:
df.iloc[-2:, -2: ]

    D  A+B
t  42   84
u  21   79

### Masking - Boolean Indexing

In [158]:
df

    A   B   C   D  A+B
p  93  54  70  51  147
q  92  18  52  67  110
r  25  85  15  90  110
s  99  56  83  40  155
t  40  44  58  42   84
u  68  11  64  21   79

In [159]:
# masking
mask = df > 30
mask

       A      B      C      D   A+B
p   True   True   True   True  True
q   True  False   True   True  True
r  False   True  False   True  True
s   True   True   True   True  True
t   True   True   True   True  True
u   True  False   True  False  True

In [160]:
df[mask]

      A     B     C     D  A+B
p  93.0  54.0  70.0  51.0  147
q  92.0   NaN  52.0  67.0  110
r   NaN  85.0   NaN  90.0  110
s  99.0  56.0  83.0  40.0  155
t  40.0  44.0  58.0  42.0   84
u  68.0   NaN  64.0   NaN   79

In [161]:
df[ df > 30 ]

      A     B     C     D  A+B
p  93.0  54.0  70.0  51.0  147
q  92.0   NaN  52.0  67.0  110
r   NaN  85.0   NaN  90.0  110
s  99.0  56.0  83.0  40.0  155
t  40.0  44.0  58.0  42.0   84
u  68.0   NaN  64.0   NaN   79

In [162]:
mask = df['B'] > 40
mask

p     True
q    False
r     True
s     True
t     True
u    False
Name: B, dtype: bool

In [163]:
df[mask]

    A   B   C   D  A+B
p  93  54  70  51  147
r  25  85  15  90  110
s  99  56  83  40  155
t  40  44  58  42   84

In [164]:
# extracting values from Col C and col D where B column has value >40
df[ df['B'] > 40 ][['C', 'D']]

    C   D
p  70  51
r  15  90
s  83  40
t  58  42

In [165]:
df['A']>40

p     True
q     True
r    False
s     True
t    False
u     True
Name: A, dtype: bool

In [166]:
df['D'] < 50

p    False
q    False
r    False
s     True
t     True
u     True
Name: D, dtype: bool

In [167]:
(df['A']> 40) & (df['D']<50)

p    False
q    False
r    False
s     True
t    False
u     True
dtype: bool

In [168]:
df[ (df['A']> 40) & (df['D']<50) ]

    A   B   C   D  A+B
s  99  56  83  40  155
u  68  11  64  21   79

In [169]:
df

    A   B   C   D  A+B
p  93  54  70  51  147
q  92  18  52  67  110
r  25  85  15  90  110
s  99  56  83  40  155
t  40  44  58  42   84
u  68  11  64  21   79

In [170]:
df_array = df.values
df_array

array([[ 93,  54,  70,  51, 147],
       [ 92,  18,  52,  67, 110],
       [ 25,  85,  15,  90, 110],
       [ 99,  56,  83,  40, 155],
       [ 40,  44,  58,  42,  84],
       [ 68,  11,  64,  21,  79]])

## Iris Dataset -  Introduction

In [171]:
!ls

'ls' is not recognized as an internal or external command,
operable program or batch file.

In [172]:
iris = pd.read_csv("./iris.csv")

FileNotFoundError: [Errno 2] No such file or directory: './iris.csv'

In [ ]:
type(iris)

In [ ]:
iris.head()

In [ ]:
iris.tail()

In [ ]:
#  total of 150 data points, 
#  columns are 5
iris.shape

In [ ]:
iris.columns

In [ ]:
iris.dtypes

In [ ]:
iris.info()

In [ ]:
iris.describe()

In [ ]:
iris['species'].nunique()

In [ ]:
iris['species'].unique()

In [ ]:
#  How many setosa flowers are there?
iris [ iris['species'] == 'versicolor' ].shape

In [ ]:
iris['species'].value_counts()['virginica']

In [ ]:
iris['sepal_length'].mean()

In [ ]:
iris['petal_width'].max()

In [ ]:
iris['petal_width'].min()

In [ ]:
iris['petal_width'].sum()

In [ ]:
iris['petal_width']

In [ ]:
iris.sort_values(by=["sepal_length", "sepal_width"])

In [ ]:
iris['species'].apply(len)

In [ ]:
len('setosa')

In [ ]:
len('virginica')

In [ ]:
iris.apply(lambda x: x + x)

### Grouping Data Together

In [ ]:
iris.aggregate('min')

In [ ]:
iris.aggregate(['min', 'max', 'mean', 'median'])

In [ ]:
groupby = iris.groupby('species')
groupby

In [ ]:
groupby.min()

In [ ]:
groupby.mean()

In [ ]:
iris[ iris['species'] == 'setosa' ]['sepal_length'].mean()

In [ ]:
groupby.count()

In [ ]:
groupby.sum()

In [ ]:
groupby.describe().T

### Handling Missing Data
- dropna()
- fillna()

In [ ]:
iris = pd.read_csv('./iris.csv')

In [ ]:
import warnings
warnings.filterwarnings('ignore')

In [ ]:
iris

In [ ]:
nan_idx = np.random.randint(0, 150, 20)
iris['sepal_length'][nan_idx] = np.nan

In [ ]:
iris['sepal_length']

In [ ]:
nan_idx = np.random.randint(0, 150, 15)
iris['petal_width'][nan_idx] = np.nan

In [ ]:
iris['petal_width']

In [ ]:
iris.isna().sum()

In [ ]:
# iris.dropna()

In [ ]:
iris['sepal_length'].fillna(value = "FILLTHIS")[:50]

In [ ]:
iris['sepal_length'] =  iris['sepal_length'].fillna(value = round(iris['sepal_length'].mean(), 1) )

In [ ]:
iris['sepal_length'][:50]

In [ ]:
iris['petal_length'][:50]

In [ ]:
iris.isna().sum()

### Concat/Merge Dataframes

In [ ]:
new_df = pd.DataFrame( np.random.randint(0, 7, size=(10, 4)))

In [ ]:
new_df

In [ ]:
new_df['species'] = "new-species"

In [ ]:
new_df.head()

In [ ]:
iris.columns

In [ ]:
new_df.columns = iris.columns

In [ ]:
new_df.head()

In [ ]:
iris = pd.concat((iris, new_df), axis=0 )

In [ ]:
iris.shape

In [ ]:
## Merging Dataframes

In [ ]:
df1 = pd.DataFrame({'S_Name' : ['Mohit', 'Jatin', 'Prateek', 'Mohit'],
                    'CGPA' :  [ 2 , 4, 5, 3]})

In [ ]:
df1

In [ ]:
df2 = pd.DataFrame({'T_Name' : ['Mohit', 'Jatin', 'Prateek', 'Mohit'],
                    'CGPA' :  [ 3 , 6, 8, 9]})

In [ ]:
df2

In [ ]:
df1.merge(df2, how = 'inner')

In [ ]:
df1.merge(df2, how = 'left')

In [ ]:
df1.merge(df2, how= 'right')

In [ ]:
df1.merge(df2, how= 'outer')

### Output Files

In [ ]:
iris

In [ ]:
iris.isna().sum()

In [ ]:
iris.to_csv('./modified_iris.csv', index=False)

In [ ]:
modified_iris = pd.read_csv('./modified_iris.csv')

In [ ]:
modified_iris.head()

In [ ]:
iris.to_excel("./new_iris.xlsx", sheet_name="iris sheet")